10/data/attachments/5b68a9a87a1f8c92.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b330e9f4-24c4-4077-81b1-730437590a80</nif:username>
            <nif:friendToBeAdded>Jennifer_open_Friend_37423_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>